In [8]:

import pandas as pd
import mysql.connector

# 3. Conecting mysql with python

In [9]:
mydb= mysql.connector.connect(host='localhost',user='root',password='75369',database='ikram')

In [15]:
cur= mydb.cursor()

# 4. Using  Python for the CRUD operation.

## 4.1 Creating table named 'PRODUCT'

In [ ]:
cur.execute('create table PRODUCT(Code int(10) PRIMARY KEY, Name varchar(50),Price int(20), Manufacturer varchar(20) UNIQUE KEY)')

In [95]:
mydb.commit()

## 4.2 Inserting 10 more data using for loop

In [208]:
Code= [1,2,3,4,5,6,7,8,9,10]
Name=['mouse','keyboard','monitor','GPU','CPU','UPS','power supply','RAM','SSD','cooling fan']
Price=[100,250,700,950,200,640,450,850,550,120]
Manufacturer=['BSRM','KSRM','ZTS','AKS','LML','PML','YTS','BTS','TIK','ABC']
x=[]
y=[]
for i in range(0,10):
    y.append(Code[i])
    y.append(Name[i])
    y.append(Price[i])
    y.append(Manufacturer[i])
    x.append(y)
    y=[]
x

[[1, 'mouse', 100, 'BSRM'],
 [2, 'keyboard', 250, 'KSRM'],
 [3, 'monitor', 700, 'ZTS'],
 [4, 'GPU', 950, 'AKS'],
 [5, 'CPU', 200, 'LML'],
 [6, 'UPS', 640, 'PML'],
 [7, 'power supply', 450, 'YTS'],
 [8, 'RAM', 850, 'BTS'],
 [9, 'SSD', 550, 'TIK'],
 [10, 'cooling fan', 120, 'ABC']]

In [209]:
#cur.executemany('''insert into PRODUCT(Code,Name,Price,Manufacturer) values(%s,%s,%s,%s)''',x)
#mydb.commit()

In [ ]:
for Code,Name,Price,Manufacturer in x:
    cur.execute('''insert into PRODUCT(Code,Name,Price,Manufacturer) values(%s ,%s, %s, %s)''',(Code,Name,Price,Manufacturer))
mydb.commit()

#                          5

In [211]:
import sqlalchemy

In [212]:
engine= sqlalchemy.create_engine('mysql+pymysql://root:75369@localhost:3306/ikram')

## 5.1 Selecting the names of all the products in the store.

In [213]:
df1=pd.read_sql_query('select Name from PRODUCT',engine)
df1

            Name
0          mouse
1       keyboard
2        monitor
3            GPU
4            CPU
5            UPS
6   power supply
7            RAM
8            SSD
9    cooling fan
10  Loudspeakers

## 5.2 Selecting the names and the prices of all the products in the store.

In [214]:
df2=pd.read_sql_query('select Name,Price from PRODUCT',engine)
df2

            Name  Price
0          mouse    100
1       keyboard    250
2        monitor    700
3            GPU    950
4            CPU    200
5            UPS    640
6   power supply    450
7            RAM    850
8            SSD    550
9    cooling fan    120
10  Loudspeakers     70

## 5.3 Select the name of the products with a price less than or equal to $200.

In [215]:
df3=pd.read_sql_query('select Name from PRODUCT where Price<=200',engine)
df3

           Name
0         mouse
1           CPU
2   cooling fan
3  Loudspeakers

## 5.4 Selecting all the products with a price between $60 and $120.

In [216]:
df4=pd.read_sql_query('select * from PRODUCT where Price between 60 and 120',engine)
df4

   Code          Name  Price Manufacturer
0     1         mouse    100         BSRM
1    10   cooling fan    120          ABC
2    11  Loudspeakers     70          NPT

## 5.5 Selecting the name and price in cents (i.e., the price must be multiplied by 100).

In [217]:
df5=pd.read_sql_query('select Name,Price*100 from PRODUCT',engine)
df5

            Name  Price*100
0          mouse      10000
1       keyboard      25000
2        monitor      70000
3            GPU      95000
4            CPU      20000
5            UPS      64000
6   power supply      45000
7            RAM      85000
8            SSD      55000
9    cooling fan      12000
10  Loudspeakers       7000

## 5.6 Computing the average price of all the products.

In [218]:
df6=pd.read_sql_query('select Price from PRODUCT',engine)
df6 
price_values=df6.values.tolist()
total_price=0
for i in range(0,10):
    total_price=total_price+price_values[i][0]
print(total_price)
average_price=total_price/10
print(average_price)

4810
481.0

In [219]:
#df_6=pd.read_sql_query('select avg(Price) from PRODUCT',engine)
#df_6

## 5.7 Computing the average price of all products with manufacturer code equal to 2.

In [220]:
df7=pd.read_sql_query('select Price from PRODUCT where Code=2 ',engine)
price_values=df7.values.tolist()
average= price_values[0][0]
average

250

In [221]:
#df_7=pd.read_sql_query('select avg(price) from PRODUCT where  Code = 2',engine)
#df_7

## 5.8 Computing the number of products with a price larger than or equal to $180.

In [222]:
df8=pd.read_sql_query('select Code from PRODUCT where Price>=180 ',engine)
code_list=df8.values.tolist()
num_of_products=len(code_list)
num_of_products

8

In [223]:
#df_8=pd.read_sql_query('select count(*) from PRODUCT where price>=180',engine)
#df_8

### 5.9 Select the name and price of all products with a price larger than or equal to $180,and sort first by price (in descending order)

In [224]:
df9=pd.read_sql_query('select Name,Price from PRODUCT where Price>=180 order by Price desc ',engine)
df9

           Name  Price
0           GPU    950
1           RAM    850
2       monitor    700
3           UPS    640
4           SSD    550
5  power supply    450
6      keyboard    250
7           CPU    200

## 5.10 Select the average price of each manufacturer's products, showing the manufacturer's name.

In [225]:
df10=pd.read_sql_query('SELECT avg(Price), Manufacturer FROM PRODUCT GROUP BY Manufacturer ',engine) #average of one product is the price of single product itself 
df10

    avg(Price) Manufacturer
0        120.0          ABC
1        950.0          AKS
2        100.0         BSRM
3        850.0          BTS
4        250.0         KSRM
5        200.0          LML
6         70.0          NPT
7        640.0          PML
8        550.0          TIK
9        450.0          YTS
10       700.0          ZTS

### 5.11 Select the names of manufacturers whose products have an average price larger than or equal to $150.

In [226]:
df11=pd.read_sql_query('SELECT Manufacturer from PRODUCT group by Manufacturer having avg(Price)>=150 ',engine)
 #average of one product is the price of single product itself
df11

  Manufacturer
0          AKS
1          BTS
2         KSRM
3          LML
4          PML
5          TIK
6          YTS
7          ZTS

## 5.12 Select the name and price of the cheapest product.

In [227]:
df12=pd.read_sql_query('select Price from PRODUCT',engine)
 
price_values=df12.values.tolist()
minimum=10000
for i in range(0,10):
    if price_values[i][0]<minimum:
        minimum=price_values[i][0]
print('price of the cheapest product:',minimum)

df__12=pd.read_sql_query('select Name,Price from PRODUCT where price=100',engine)
df__12

price of the cheapest product: 100

    Name  Price
0  mouse    100

In [228]:
#df_12= pd.read_sql_query('select Name, Price from PRODUCT where Price = (select min(Price) from PRODUCT)', engine)
#df_12

## 5.13 Add a new product: Loudspeakers, $70,manufacturer 2.

In [ ]:
df13= pd.read_sql_query("insert into PRODUCT(Code,Name,Price,Manufacturer)  values (11, 'Loudspeakers', 70, 'NPT')",engine)

In [234]:
pd.read_sql_query("select * from PRODUCT",engine) #after adding

    Code          Name  Price Manufacturer
0      1         mouse    100         BSRM
1      2      keyboard    250         KSRM
2      3       monitor    700          ZTS
3      4           GPU    950          AKS
4      5           CPU    200          LML
5      6           UPS    640          PML
6      7  power supply    450          YTS
7      8           RAM    850          BTS
8      9           SSD    550          TIK
9     10   cooling fan    120          ABC
10    11  Loudspeakers     70          NPT

## 5.14 Update the name of product 8 to "Laser Printer".

In [ ]:
df14= pd.read_sql_query("UPDATE PRODUCT SET Name='Laser Printer' WHERE PRODUCT.Code=8",engine)

In [236]:
pd.read_sql_query("select * from PRODUCT",engine) # after updating

    Code           Name  Price Manufacturer
0      1          mouse    100         BSRM
1      2       keyboard    250         KSRM
2      3        monitor    700          ZTS
3      4            GPU    950          AKS
4      5            CPU    200          LML
5      6            UPS    640          PML
6      7   power supply    450          YTS
7      8  Laser Printer    850          BTS
8      9            SSD    550          TIK
9     10    cooling fan    120          ABC
10    11   Loudspeakers     70          NPT

## 5.15 DELETE the last 4 rows where price is greater than $300.

In [ ]:
df15= pd.read_sql_query("DELETE FROM PRODUCT  WHERE Code>7 and Price>300",engine)

In [238]:
pd.read_sql_query("select * from PRODUCT",engine) # after deleting

   Code          Name  Price Manufacturer
0     1         mouse    100         BSRM
1     2      keyboard    250         KSRM
2     3       monitor    700          ZTS
3     4           GPU    950          AKS
4     5           CPU    200          LML
5     6           UPS    640          PML
6     7  power supply    450          YTS
7    10   cooling fan    120          ABC
8    11  Loudspeakers     70          NPT